/*
Задача №1 - Первая программа
Вывести на консоль текст “Hello World!”:
Скачать и установить IntelliJ IDEA.
Написать первую программу, которая выводит в консоль строку “Hello World!”.
Подключиться к GitHub, залить программу в созданный репозиторий.
 */

package com.max.idea;
public class Main {
    public static void main(String[] args) {
        System.out.println("Hello world!");
    }
}